import streamlit as st



st.title("وين نسكن في الرياض؟")
image = "Riyadh.jpeg"
st.image(image, caption="")

#st.set_option('deprecation.showPyplotGlobalUse', False)
#st.set_option('text.alignment', 'right')

statement = ""
st.write("أنا سامر ، وفي يوم من الأيام تخرجت من الجامعة الحمدلله وبدأ وقت الضياع، الى أن جاء اليوم اللي تغيرت فيه الأحداث، وجاني رابط تسجيل في معسكرات طويق!!")
st.write("قدمت واختبرت وخلصت المقابلات وبعدها نمت، لما قمت لقيت المفاجأة! رسالة القبول!!! واو أنا ايش سويت، معقولة انقبلت!! ")
st.write("طيب ايش اسوي الحين! وايش الخطوة اللي بعدها! أنا في مدينة وأكاديمية طويق في مدينة ثانية، الوضع جديد بالنسبة لي ومدينة غريبة عني، مافيه إلا أني أشوف صديقي محمد ")
st.write("سامر: محمد انقبلت بالمعسكر؟ ")
st.write("محمد: ايوه")
st.write("سامر: طيب تخاوي الرياض؟ ")
st.write("محمد: أكيد طبعا.. ")
st.write("سامر: كيف نظام السكن الحين؟ والمعيشة؟ شرايك نسكن سوا؟ ")
st.write("محمد: ممم تمام قدام ")
st.write("سامر: طيب وين نروح؟ ناخذ شقه و ناخذ راحتنا فيها؟ احنا نبغا شي حديث لان الاشياء القديمه تجيب الاكتئاب")
st.write("محمد:  ما ناقصنا اكتئاب , خلينا نشوف الأسعار")



image =  "image1.png"
st.image(image, caption="")

statement = """ سامر: اوف والله غالية الاشياء الجديده شكلنا بندور شي قديم لان سعره اقل شرايك؟
محمد: يعني كيف؟ مثلا شقة صغيرة , لا والله ما أبغى أسكن بشقة صغيرة
سامر: طيب عندك حل؟ 
محمد: مدري بشوف أدور، خلينا نشوف نايف وش صار عليه
سامر: "يدق على نايف" نايف هاه بشر انقبلت بالمسعكر؟ 
نايف: ايوه الحمدلله بس مدري وين أسكن
محمد وسامر: نفس مشكلتنا
نايف: دقيقة يا شباب خلوني أفكر... اه لقيتها! باخذ أرض
 (لحظة صمت) 
سامر: منجدك أرض!! 
نايف: ايوه وبشوف الأسعار ويمكن أعيش بالرياض واخذها بزنس
 """
st.write(statement)

image =  "image2.png"
st.image(image, caption="")



statement = """ سامر: تحسب نفسك عايش بالمدينة! هذي الرياض يا حبيبي هذي اقل اسعار للارضي , اقل ارض بمية الف!   
نايف : طيب بفكر , لا تنفخ
محمد: طيب ايش رايكم ندور عن شقه ثلاث غرف في حي قريب من الاكاديميه ؟
نايف : حي النرجس اقرب شي للمعسكر 
"""

st.write(statement)

image =  "imge3.png"
st.image(image, caption="")

statement = """محمد : والله انا شايف اسعار الثلاث غرف و الغرفتين في حي النرجس غاليه اسعارها تبدا من 30 الف الى 100 الف 
سامر : انا اشوف اني ادفع في غرفه 30 الف وتكون مرتبه احسن من ادفع 30 الف في ثلاث غرف مبهدله 
نايف : انا بروح اسكن عند اخوي وكل واحد يدبر عمره 
سامر : يلا يا اخوان الوالد يناديني 

"""
st.write(statement)


statement = " النهاية... لا تسكن مع صديقك وشوف اللي يناسبك ويناسب الميزانية"
st.write(statement)