import streamlit as st

#st.set_page_config(page_title="Hello")

st.title("وين نسكن في الرياض؟")
image = "Riyadh.jpeg"


statement = "أنا سامر غربي، وفي يوم من الأيام تخرجت من الجامعة الحمدلله وبدأ وقت الضياع، الى أن جاء اليوم اللي تغيرت فيه الأحداث، وجاني رابط تسجيل في معسكرات طويق!! ، قدمت واختبرت وخلصت المقابلات وبعدها نمت، لما قمت لقيت المفاجأة! رسالة القبول!!! واو أنا ايش سويت، معقولة انقبلت!! طيب ايش اسوي الحين! وايش الخطوة اللي بعدها! أنا في مدينة وأكاديمية طويق في مدينة ثانية، الوضع جديد بالنسبة لي ومدينة غريبة عني، مافيه إلا أني أشوف صديقي محمد "
st.write(statement)

image =  ""
st.image(image, caption="")

