import streamlit as st

#st.set_page_config(page_title="Hello")

st.title("وين نسكن في الرياض؟")
image = "applee.jpg"
st.image(image, caption="")


statement = "أنا سامر غربي، وفي يوم من الأيام تخرجت من الجامعة الحمدلله وبدأ وقت الضياع، الى أن جاء اليوم اللي تغيرت فيه الأحداث، وجاني رابط تسجيل في معسكرات طويق!! ، قدمت واختبرت وخلصت المقابلات وبعدها نمت، لما قمت لقيت المفاجأة! رسالة القبول!!! واو أنا ايش سويت، معقولة انقبلت!! طيب ايش اسوي الحين! وايش الخطوة اللي بعدها! أنا في مدينة وأكاديمية طويق في مدينة ثانية، الوضع جديد بالنسبة لي ومدينة غريبة عني، مافيه إلا أني أشوف صديقي محمد "
st.write(statement)

image =  ""
st.image(image, caption="")

statement = """سامر: محمد انقبلت بالمعسكر؟ 
محمد: ايوه
سامر: طيب تخاوي الرياض؟ 
محمد: أكيد طبعا.. 
سامر: كيف نظام السكن الحين؟ والمعيشة؟ شرايك نسكن سوا؟ 
محمد: ممم تمام قدام 
سامر: طيب وين نروح؟ ناخذ فله وناخذ راحتنا فيها؟ 
محمد: خلينا نشوف الأسعار 
"""
st.write(statement)

image =  ""
st.image(image, caption="")



statement = """سامر: اوف والله غالية، ايش رايك شيء أصغر؟ 
محمد: يعني كيف؟ مثلا شقة صغيرة
محمد: لا والله ما أبغى أسكن بشقة صغيرة
سامر: طيب عندك حل؟ 
محمد: مدري بشوف أدور، خلينا نشوف نايف وش صار عليه
سامر: "يدق على نايف" نايف هاه بشر انقبلت بالمسعكر؟ 
نايف: ايوه الحمدلله بس مدري وين أسكن
محمد وسامر: نفس مشكلتنا
نايف: دقيقة يا شباب خلوني أفكر... اه لقيتها! باخذ أرض
 (لحظة صمت) 
سامر: منجدك أرض!! 
نايف: ايوه وبشوف الأسعار ويمكن أعيش بالرياض واخذها بزنس
"""
st.write(statement)

image =  ""
st.image(image, caption="")

statement = """ 
سامر: تحسب نفسك عايش بالمدينة! هذي الرياض يا حبيبي، المهم بالتوفيق لك أنا بشوف لي شقة صغيرة واللي تكون موقعها قريب من الأكاديمية. 
محمد: تخليت عني؟ 
سامر: يا حبيبي كل واحد يدور اللي يناسب وضعه.. 
"""
st.write(statement)


image =  ""
st.image(image, caption="")

statement = " النهاية... لا تسكن مع صديقك وشوف اللي يناسبك ويناسب الميزانية"
st.write(statement)